# -*- encoding:utf-8 -*-

'''
Arr lisan
'''

# 男子内衣
app_2813 = [
    {
        'sig': 'china',
        'title': '中国',
        'list': ['72-76', '76-81', '81-87', '87-93', '93-98'],
    },
    {'sig': 'guoji', 'title': '国际', 'list': ['S', 'M', 'L', 'XL', 'XXL']},
    {
        'sig': 'america',
        'title': '美国（英寸）',
        'list': ['28-30', '30-32', '32-34', '34-38', '38-42'],
    },
]
#  女子服装
app_2812 = [
    {
        'sig': 'china',
        'title': '中国型号',
        'list': [
            '160-165/84-86',
            '165-170/88-90	',
            '167-172/92-96',
            '168-173/98-102',
            '170-176/106-110',
        ],
    },
    {'sig': 'guoji', 'title': '国际', 'list': ['XS', 'S', 'M', 'L', 'XL']},
    {'sig': 'america', 'title': '美国', 'list': ['2', '4-6', '8-10', '12-14', '16-18']},
    {'sig': 'europe', 'title': '欧洲', 'list': ['34', '34-36', '38-40', '42', '44']},
]

# 女子内衣

app_2814 = [
    {
        'sig': 'china',
        'title': "中国",
        'list': ["S", "M", "L", "XL", "XXL", "XXXL", "XXXXL(无此型号)"],
    },
    {'sig': 'guoji', 'title': "国际", 'list': ["XS", "S", "M", "L", "XL", "XXL", "XXXL"]},
    {'sig': 'america', 'title': "美国", 'list': ["2", "4", "6", "8", "10", "12", "14"]},
    {
        'sig': 'engliand',
        'title': "英国",
        'list': ["6", "8", "10", "12", "14", "16", "18"],
    },
    {
        'sig': 'europe',
        'title': "欧洲",
        'list': ["32", "34", "36", "38", "40", "42", "44"],
    },
    {
        'sig': 'france',
        'title': "法国",
        'list': ["34", "36", "38", "40", "42", "44", "46"],
    },
    {
        'sig': 'italy',
        'title': "意大利",
        'list': ["38", "40", "42", "44", "46", "48", "50"],
    },
]

# 裤子腰围
app_2765 = [
    {
        "sig": "haoma",
        "title": "号码",
        "list": ["29码", "30码", "31码", "32码", "33码", "34码", "36码", "38码", "40码"],
    },
    {
        "sig": "chi",
        "title": "尺",
        "list": ["2.2", "2.3", "2.4", "2.5", "2.6", "2.7", "2.8", "2.9", "3"],
    },
    {
        "sig": "limi",
        "title": "厘米",
        "list": ["73.5", "77", "80", "83.5", "87", "90", "93.5", "97", "100"],
    },
    {
        "sig": "yincun",
        "title": "英寸",
        "list": ["28.9", "30.3", "31.5", "33", "34.3", "35.4", "36.8", "38", "39.4"],
    },
]

all_app = globals().copy()
